src/Documents/СписаниеИзПереработки/СписаниеИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеИзПереработки</name>
  <basedOn>Document.ПередачаВПереработку</basedOn>
  <registerRecords>AccumulationRegister.ПередачиВПереработку</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПередачиВПереработку/ПередачиВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПереработку</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/СписаниеИзПереработки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
ДокументОснование = ДанныеЗаполнения.Ссылка;
Подразделение = ДанныеЗаполнения.Подразделение;
Контрагент = ДанныеЗаполнения.Контрагент;
Договор = ДанныеЗаполнения.Договор;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПереработкуОстатки.ВидМПЗ,
	|	ПередачиВПереработкуОстатки.МПЗ,
	|	ПередачиВПереработкуОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПередачиВПереработку.Остатки КАК ПередачиВПереработкуОстатки
	|ГДЕ
	|	ПередачиВПереработкуОстатки.Контрагент = &Контрагент
	|	И ПередачиВПереработкуОстатки.Договор = &Договор
	|	И ПередачиВПереработкуОстатки.ПередачаВПереработку = &ПередачаВПереработку";
Запрос.УстановитьПараметр("Контрагент", Контрагент);
Запрос.УстановитьПараметр("Договор", Договор);
Запрос.УстановитьПараметр("ПередачаВПереработку", ДокументОснование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = ВыборкаДетальныеЗаписи.ВидМПЗ;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ПередачиВПереработку Расход
Движения.ПередачиВПереработку.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Фильтр.Вставить("Контрагент",Контрагент);
	Фильтр.Вставить("Договор", Договор);
	Фильтр.Вставить("ПередачаВПереработку", ДокументОснование);
	Остаток = РегистрыНакопления.ПередачиВПереработку.Остатки(Дата,Фильтр,"МПЗ,Контрагент,Договор,ПередачаВПереработку", "Количество");
		Если Остаток.Количество() > 0 Тогда
		КолОстаток = Остаток[0].Количество;
		Иначе
		КолОстаток = 0;
		КонецЕсли; 
			Если КолОстаток >= ТЧ.Количество Тогда
			Движение = Движения.ПередачиВПереработку.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.Номенклатура = ДокументОснование.Номенклатура;
			Движение.ВидМПЗ = ТЧ.ВидМПЗ;
			Движение.МПЗ = ТЧ.МПЗ;
			Движение.ПередачаВПереработку = ДокументОснование;
			Движение.Количество = ТЧ.Количество;
			Иначе
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(ЭтотОбъект);	
			Сообщение.Текст = "МПЗ "+ТЧ.МПЗ+" требуется списать: "+ТЧ.Количество+" остаток: "+КолОстаток;
			Сообщение.Сообщить();
			КонецЕсли; 		
	КонецЦикла;
КонецПроцедуры
